/* error dialog default title */
TIME_MACHINE_ERROR = "バックアップを完了できませんでした。";

/* error dialog buttons */
OK = "OK";
PREFERENCES = "Time Machine 環境設定を開く...";

/* string which is shown instead of the _SHOWPREFS message for managed prefs configurations */
MANAGED_PREFS = "このコンピュータの Time Machine 設定は、管理された環境設定で制御されます。システム管理者に問い合わせてください。";

/* error messages - shared with TMPref pane*/

// NO_ERROR
RESULTCODE_0_MESSAGE = "エラーはありません。";

// BACKUP_FAILED_LAUNCH
RESULTCODE_1_MESSAGE = "Time Machine を起動できません。";  

// BACKUP_FAILED_SETUP
RESULTCODE_2_MESSAGE = "バックアップの作成を完了できません。バックアップフォルダの作成中にエラーが起きました。"; 

// BACKUP_FAILED_TARGETVOL_UNSUPPORTED_FS
RESULTCODE_3_MESSAGE = "バックアップディスクは Mac OS 拡張（ジャーナリング）フォーマットでなければなりませんが、フォーマットが異なります。\n\n%@"; 
RESULTCODE_3_SHOWPREFS = "Time Machine 環境設定を開き、別のバックアップディスクを選択してください。";

// BACKUP_FAILED_TARGETVOL_STATFS_FAILED
RESULTCODE_4_MESSAGE = "バックアップディスクの状況を取得できません。"; 

// BACKUP_FAILED_TARGETVOL_OWNERS_DISABLED
RESULTCODE_5_MESSAGE = "バックアップディスクで所有権が有効ではありません。このディスクを Time Machine バックアップに使用するには、所有権を有効にする必要があります。\n\n%@"; 
RESULTCODE_5_SHOWPREFS = "Time Machine 環境設定を開き、別のバックアップディスクを選択してください。";

// BACKUP_FAILED_TARGETVOL_NOT_JOURNALED
RESULTCODE_6_MESSAGE = "バックアップディスクは Mac OS 拡張（ジャーナリング）フォーマットでなければなりませんが、フォーマットが異なります。\n\n%@";
RESULTCODE_6_SHOWPREFS = "Time Machine 環境設定を開き、別のバックアップディスクを選択してください。"; 

// BACKUP_FAILED_TARGETVOL_DISK_SPACE
RESULTCODE_7_MESSAGE = "このバックアップのサイズが大きすぎるため、バックアップディスクに書き込めません。バックアップには %@ 必要ですが、%@ しかありません。\n\n%@";
RESULTCODE_7_SHOWPREFS = "Time Machine には、バックアップを保存するために必要な領域のほかに、そのバックアップディスク上に作業領域が必要です。Time Machine 環境設定を開き、より大きいバックアップディスクを選択するか、ファイルを除外してバックアップを小さくしてください。"; 

// BACKUP_FAILED_TARGETVOL_READONLY
RESULTCODE_8_MESSAGE = "ファイルをバックアップディスクにコピーできません。ファイルが“読み出しのみ”になっているようです。\n\n%@";
RESULTCODE_8_SHOWPREFS = "ディスクユーティリティを使用してディスクを修復または再フォーマットする必要がある可能性があります。ディスクを修復できない場合は、別のディスクをバックアップに使用する必要があります。Time Machine 環境設定を開いて別のバックアップディスクを選択してください。"; 

// BACKUP_FAILED_TARGETVOL_ACLS_DISABLED
RESULTCODE_9_MESSAGE = "バックアップディスクではアクセス制御リストが有効でなければなりませんが、有効になっていません。\n\n%@";
RESULTCODE_9_SHOWPREFS = "Time Machine 環境設定を開き、別のバックアップディスクを選択してください。"; 

// BACKUP_FAILED_PREFLIGHT_STAGE
RESULTCODE_10_MESSAGE = "バックアップの準備中にエラーが起きました。"; 

// BACKUP_FAILED_COPY_STAGE
RESULTCODE_11_HEADER = "バックアップディスクへのファイルのコピー中にエラーが起きたため、バックアップを完了できませんでした。";
RESULTCODE_11_MESSAGE = "一時的に問題が起きた可能性があります。後でバックアップをもう一度やり直してください。問題を解決できない場合は、ディスクユーティリティを使用してバックアップディスクを修復してください。";

// BACKUP_FAILED_LINK_SOURCE
RESULTCODE_12_MESSAGE = "バックアップディスクでファイルのリンク中にエラーが起きました。"; 

//  BACKUP_FAILED_TOO_MUCH_ACTIVITY
RESULTCODE_13_MESSAGE = "バックアップの作成中に変更されたファイルが多すぎます。"; 

// BACKUP_FAILED_SNAPSHOT_DELETE_FAILED 
RESULTCODE_14_MESSAGE = "バックアップディスクから有効期限が切れたバックアップを削除しようとしているときにエラーが起きました。";

// BACKUP_FAILED_CULLING_DISABLED
RESULTCODE_15_MESSAGE = "有効期限切れのバックアップはすべて削除されましたが、バックアップディスクはまだ一杯です。\n\n%@";
RESULTCODE_15_SHOWPREFS = "Time Machine 環境設定を開き、より大きいバックアップディスクを選択してください。";

// BACKUP_FAILED_CULLING_DATELIMIT
RESULTCODE_16_MESSAGE = "有効期限切れのバックアップはすべて削除されましたが、バックアップディスクはまだ一杯です。\n\n%@";
RESULTCODE_16_SHOWPREFS = "Time Machine 環境設定を開き、より大きいバックアップディスクを選択してください。"; 

// BACKUP_FAILED_TARGETVOL_NOT_SPECIFIED
RESULTCODE_17_MESSAGE = "バックアップディスクが選択されていません。\n\n%@";
RESULTCODE_17_SHOWPREFS = "Time Machine 環境設定を開き、バックアップディスクを選択してください。";

// BACKUP_FAILED_TARGETVOL_NOT_FOUND
RESULTCODE_18_MESSAGE = "バックアップディスクが見つかりませんでした。\n\n%@";
RESULTCODE_18_SHOWPREFS = "バックアップディスクが接続されていることを確認するか、Time Machine 環境設定を開き、別のバックアップディスクを選択してください。"; 

// BACKUP_FAILED_TARGETVOL_NOT_MOUNTED
RESULTCODE_19_MESSAGE = "バックアップディスクは利用できません。"; 

// BACKUP_FAILED_DISK_IMAGE_NOT_CREATED
RESULTCODE_20_MESSAGE = "バックアップ・ディスク・イメージ“%@”を作成できませんでした（エラー %@）。"; 

// BACKUP_FAILED_DISK_IMAGE_NOT_MOUNTED
RESULTCODE_21_MESSAGE = "バックアップ・ディスク・イメージ“%@”にアクセスできませんでした（エラー %@）。"; 

// BACKUP_CANCELED
RESULTCODE_22_MESSAGE = "バックアップがキャンセルされました。"; 

// BACKUP_FAILED_CASE_SENSITIVITY
RESULTCODE_23_MESSAGE = "バックアップしているディスクは大文字／小文字が区別されますが、バックアップディスクでは区別していません。\n\n%@";
RESULTCODE_23_SHOWPREFS = "Time Machine 環境設定を開き、別のバックアップディスクを選択するか、大文字／小文字を区別するディスクをバックアップしないように選択してください。"; 

// BACKUP_FAILED_DUPLICATE_VOLNAMES
RESULTCODE_24_MESSAGE = "バックアップを作成する 2 つのディスクに同じ名前が付いています。どちらかの名前を変更してください。"; 

// BACKUP_FAILED_NO_SOURCE_VOLUMES
RESULTCODE_25_MESSAGE = "バックアップの対象に設定できるディスクがありません。すべてのディスクが“バックアップから除外する項目”リストに含まれている場合に、このような状況が発生する可能性があります。\n\n%@";
RESULTCODE_25_SHOWPREFS = "リストを編集するには、Time Machine 環境設定を開き、“オプション”をクリックします。";

// BACKUP_FAILED_NETWORK_INTERRUPTION
RESULTCODE_26_HEADER = "ネットワークの問題によりバックアップを完了できませんでした。";
RESULTCODE_26_MESSAGE = "コンピュータとバックアップディスクが同じネットワーク上にあること、およびバックアップディスクの電源が入っていることを確認してください。その後、バックアップをもう一度試してください。";

// BACKUP_FAILED_DISK_INTERRUPTION
RESULTCODE_27_MESSAGE = "バックアップディスクが取り出されたか、コンピュータから取り外された可能性があります。";

// BACKUP_FAILED_TARGETVOL_DISK_SPACE_DURING_BACKUP
RESULTCODE_28_MESSAGE = "バックアップディスクの容量が予期せず足りませんでした。Time Machine は、スケジュールされている次回バックアップ時に、有効期限切れのバックアップを削除してより多くの領域の確保を試みます。\n\n%@";
RESULTCODE_28_SHOWPREFS = "Time Machine 環境設定を開き、より大きいバックアップディスクを選択するか、ファイルを除外してバックアップを小さくしてください。"; 

// BACKUP_FAILED_AUTHENTICATION_ERROR
RESULTCODE_29_MESSAGE = "ネットワーク・バックアップ・ディスクにアクセスできませんでした。ネットワーク・ユーザ名またはパスワードに問題があります。\n\n%@";
RESULTCODE_29_SHOWPREFS = "Time Machine 環境設定を開き、ネットワーク・バックアップ・ディスクを選択して正しいユーザ名とパスワードを再入力してください。";

// BACKUP_FAILED_UNABLE_TO_REUSE_BACKUP
RESULTCODE_30_MESSAGE = "バックアップ“%@”を再使用しようとしているときにエラーが起きました。";

// BACKUP_FAILED_DISK_IMAGE_BUSY
RESULTCODE_31_MESSAGE = "バックアップ・ディスク・イメージ“%@”はすでに使用中です。";

// BACKUP_FAILED_DISK_IMAGE_NOT_FOUND
RESULTCODE_32_MESSAGE = "バックアップ・ディスク・イメージ“%@”が見つかりませんでした。";

// BACKUP_FAILED_CLOCK_WRONG
RESULTCODE_33_MESSAGE = "システムの日時が正しくありません。";

// BACKUP_FAILED_NO_PRIMARY_NETWORK_INTERFACE
RESULTCODE_34_MESSAGE = "コンピュータにプライマリ・ネットワーク・インターフェイスがありません。";

// BACKUP_FAILED_BOOT_COOKIE_NOT_FOUND
RESULTCODE_35_MESSAGE = "Time Machine 設定の一部が見つかりませんでした。\n\n%@";
RESULTCODE_35_SHOWPREFS = "Time Machine の設定を再構成するには、Time Machine 環境設定を開き、バックアップディスクを再選択してください。";

// BACKUP_FAILED_DESTINATION_COOKIE_NOT_FOUND
RESULTCODE_36_MESSAGE = "バックアップディスク“%@”で Time Machine 設定の一部が見つかりませんでした。\n\nバックアップディスクが接続されていること、およびほかに接続しているディスクでバックアップディスクと同じ名前を使用していないことを確認してください。\n\n%@";
RESULTCODE_36_SHOWPREFS = "Time Machine の設定を再構成するには、Time Machine 環境設定を開き、バックアップディスクを再選択してください。";

// BACKUP_FAILED_DISK_SOURCE_INTERRUPTION
RESULTCODE_37_MESSAGE = "バックアップされているディスクのいずれかが取り出されたか、コンピュータから取り外された可能性があります。";

// BACKUP_FAILED_TARGETIMAGE_READONLY
RESULTCODE_38_MESSAGE = "このディスクイメージは書き込みが禁止されているため、Time Machine はこのディスクイメージを利用できません。";

// BACKUP_HC_FAILED_TARGETVOL_RESOLUTION_FAILED
RESULTCODE_40_HEADER = "バックアップディスクが利用可能な状態ではないため、Time Machine はバックアップを検証できませんでした。";
RESULTCODE_40_MESSAGE = "コンピュータとバックアップディスクが同じネットワーク上にあること、およびバックアップディスクの電源が入っていることを確認してください。その後、バックアップの検証をやり直してください。";

// BACKUP_HC_FAILED_TARGETVOL_READONLY
RESULTCODE_41_HEADER = "Time Machine はバックアップを検証できませんでした。";
RESULTCODE_41_MESSAGE = "このバックアップディスクは“読み出しのみ”になっているようです。";

// BACKUP_HC_VERIFICATION_INTERRUPTED
RESULTCODE_42_HEADER = "検証プロセスが中断されたため、Time Machine はバックアップを検証できませんでした。";
RESULTCODE_42_MESSAGE = "中断は、通常ネットワークの問題により生じます。ネットワークの問題が解決してからやり直してください。";

// BACKUP_FAILED_TO_ABANDON_IMAGE
RESULTCODE_43_MESSAGE = "既存のバックアップ・ディスク・イメージ“%@”を移動させられませんでした";

// BACKUP_FAILED_TO_DELETE_IMAGE
RESULTCODE_44_MESSAGE = "バックアップ・ディスク・イメージ“%@”を削除できませんでした";

// BACKUP_FAILED_UNKNOWN
RESULTCODE_999_MESSAGE = "エラーコード：%@";

// BACKUP_WARNING_LOW_DISK_MESSAGE
RESULTCODE_1000_HEADER = "バックアップディスクはほとんど一杯です。";
RESULTCODE_1000_MESSAGE = "バックアップディスクが一杯になると、新しいバックアップ用の空き領域を確保するために古いバックアップが削除されます。\n\n%@";
RESULTCODE_1000_SHOWPREFS = "古いバックアップをすべて保持したい場合は、Time Machine 環境設定を開き、新しいバックアップディスクを選択してください。";

// BACKUP_WARNING_THINNING_START
RESULTCODE_1001_HEADER = "バックアップディスクは一杯です。";
RESULTCODE_1001_MESSAGE = "Time Machine は、新しいバックアップ用の領域を確保するために、1 つ以上の古いバックアップを削除しました。残っている最も古いバックアップは次のものです：%@\n\n%@";
RESULTCODE_1001_SHOWPREFS = "さらに古いバックアップが削除されないようにするには、Time Machine 環境設定を開き、別のバックアップディスクを選択してください。"; 
RESULTCODE_1001_CHECKBOX = "今後この警告を表示しない。";

// BACKUP_WARNING_NO_RECENT_BACKUPS
RESULTCODE_1002_MESSAGE = "お使いのコンピュータのバックアップが、ここ %@ 日間作成されていません。\n\n%@"; 
RESULTCODE_1002_SHOWPREFS = "バックアップディスクが使用可能な状態であることを確認するか、Time Machine 環境設定を開き、新しいバックアップディスクを選択してください。";

// BACKUP_WARNING_REUSE_BACKUPS
RESULTCODE_1003_HEADER = "このコンピュータにバックアップ“%@”を再使用しますか？";
RESULTCODE_1003_MESSAGE = "バックアップは別のコンピュータで作成されました。このバックアップを再使用すると、元のコンピュータでは使用できなくなります。";
REUSE_BACKUP_BUTTON = "バックアップを再使用";
CREATE_NEW_BACKUP_BUTTON = "新規バックアップを作成";
ASK_LATER_BUTTON = "今はバックアップしない";

// BACKUP_WARNING_FIRMWARE 
RESULTCODE_1004_HEADER = "“%@”のアップデートがあります。";
RESULTCODE_1004_MESSAGE = "このアップデートにより Time Capsule の信頼性が向上します。アップデートをインストールするには、“AirMac ユーティリティ”を開いてください。“%@”の Time Capsule パスワードを入力する必要がある場合があります。";
REMIND_LATER_BUTTON = "あとでアップデート";
AIRPORT_UTILITY_BUTTON = "AirMac ユーティリティを開く...";

// BACKUP_WARNING_DELETE_IMAGE 
RESULTCODE_1006_HEADER = "Time Machine によるバックアップの検証が完了しました。信頼性を向上するために、新規バックアップの作成が必要になりました。";
RESULTCODE_1006_MESSAGE = "新規バックアップを作成するには、“新規バックアップを開始”をクリックしてください。これにより既存のバックアップ履歴は削除されます。数時間かかることがあります。\n\n“後でバックアップ”をクリックすると、明日もう一度通知され、それまで Time Machine によるバックアップは実行されません。";
CREATE_RECOVERY_IMAGE_NOW_BUTTON = "新規バックアップを開始";
CREATE_RECOVERY_IMAGE_ASK_LATER_BUTTON = "後でバックアップ";

// BACKUP_WARNING_TARGETVOL_CHANGED
RESULTCODE_1008_HEADER = "バックアップディスクの識別情報が、最後のバックアップ作成時から変更されています。";
RESULTCODE_1008_MESSAGE = "ディスクが別のディスクに交換されたり消去されたりしたか、第三者が偽って別のディスクにバックアップを作成するように操作している可能性があります。";
BACKUP_WARNING_TARGETVOL_CHANGED_OK_BUTTON = "このディスクを使用";
BACKUP_WARNING_TARGETVOL_CHANGED_CANCEL_BUTTON = "バックアップを作成しない";

// UNITS
KB = "KB";
MB = "MB";
GB = "GB";
TB = "TB";
